In [2]:
import pandas as pd
df = pd.read_csv('Finance_data.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 24 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   gender                             40 non-null     object
 1   age                                31 non-null     float64
 2   Investment_Avenues                 40 non-null     object
 3   Mutual_Funds                       39 non-null     float64
 4   Equity_Market                      39 non-null     float64
 5   Debentures                         39 non-null     float64
 6   Government_Bonds                   40 non-null     int64
 7   Fixed_Deposits                     40 non-null     int64
 8   PPF                                40 non-null     int64
 9   Gold                               40 non-null     int64
 10  Stock_Marktet                      34 non-null     object
 11  Factor                             37 non-null     object
 12  Objective                          39 non-null     object
 13  Purpose                            37 non-null     object
 14  Duration                           39 non-null     object
 15  Invest_Monitor                     37 non-null     object
 16  Expect                             39 non-null     object
 17  Avenue                             40 non-null     object
 18  What are your savings objectives?  40 non-null     object
 19  Reason_Equity                      40 non-null     object
 20  Reason_Mutual                      40 non-null     object
 21  Reason_Bonds                       40 non-null     object
 22  Reason_FD                          40 non-null     object
 23  Source                             40 non-null     object
dtypes: float64(4), int64(4), object(16)
memory usage: 7.6+ KB

In [18]:
df.isnull().sum()

gender                               0
age                                  9
Investment_Avenues                   0
Mutual_Funds                         1
Equity_Market                        1
Debentures                           1
Government_Bonds                     0
Fixed_Deposits                       0
PPF                                  0
Gold                                 0
Stock_Marktet                        6
Factor                               3
Objective                            1
Purpose                              3
Duration                             1
Invest_Monitor                       3
Expect                               1
Avenue                               0
What are your savings objectives?    0
Reason_Equity                        0
Reason_Mutual                        0
Reason_Bonds                         0
Reason_FD                            0
Source                               0
dtype: int64

In [19]:
#5ta usulda
df['age'].fillna(df['age'].mean(), inplace=True)
df['Stock_Marktet'].fillna(df['Stock_Marktet'].mode(), inplace=True)
df['Mutual_Funds'].fillna(df['Mutual_Funds'].median(), inplace=True)
df['Gold'].fillna(100, axis=0)
df['Expect'].dropna()

/var/folders/2s/kw_rwvhn10q4r6bv09y0my5r0000gn/T/ipykernel_2515/1644704826.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].mean(), inplace=True)
/var/folders/2s/kw_rwvhn10q4r6bv09y0my5r0000gn/T/ipykernel_2515/1644704826.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Stock_Marktet'].fillna(df['Stock_Marktet'].mode(), inplace=True)
/var/folders/2s/kw_rwvhn10q4r6bv09y0my5r0000gn/T/ipykernel_2515/1644704826.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Mutual_Funds'].fillna(df['Mutual_Funds'].median(), inplace=True)

0     20%-30%
1     20%-30%
2     20%-30%
3     10%-20%
4     20%-30%
5     30%-40%
6     20%-30%
7     20%-30%
8     20%-30%
9     30%-40%
10    20%-30%
11    20%-30%
12    20%-30%
13    20%-30%
14    20%-30%
15    20%-30%
16    20%-30%
17    20%-30%
18    20%-30%
19    20%-30%
20    20%-30%
21    20%-30%
22    20%-30%
24    30%-40%
25    20%-30%
26    20%-30%
27    20%-30%
28    20%-30%
29    10%-20%
30    10%-20%
31    20%-30%
32    30%-40%
33    20%-30%
34    20%-30%
35    20%-30%
36    20%-30%
37    30%-40%
38    20%-30%
39    20%-30%
Name: Expect, dtype: object

In [20]:
df.isnull().sum()

gender                               0
age                                  0
Investment_Avenues                   0
Mutual_Funds                         0
Equity_Market                        1
Debentures                           1
Government_Bonds                     0
Fixed_Deposits                       0
PPF                                  0
Gold                                 0
Stock_Marktet                        6
Factor                               3
Objective                            1
Purpose                              3
Duration                             1
Invest_Monitor                       3
Expect                               1
Avenue                               0
What are your savings objectives?    0
Reason_Equity                        0
Reason_Mutual                        0
Reason_Bonds                         0
Reason_FD                            0
Source                               0
dtype: int64

In [21]:
#for bilan
df = pd.read_csv('Finance_data.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 24 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   gender                             40 non-null     object
 1   age                                31 non-null     float64
 2   Investment_Avenues                 40 non-null     object
 3   Mutual_Funds                       39 non-null     float64
 4   Equity_Market                      39 non-null     float64
 5   Debentures                         39 non-null     float64
 6   Government_Bonds                   40 non-null     int64
 7   Fixed_Deposits                     40 non-null     int64
 8   PPF                                40 non-null     int64
 9   Gold                               40 non-null     int64
 10  Stock_Marktet                      34 non-null     object
 11  Factor                             37 non-null     object
 12  Objective                          39 non-null     object
 13  Purpose                            37 non-null     object
 14  Duration                           39 non-null     object
 15  Invest_Monitor                     37 non-null     object
 16  Expect                             39 non-null     object
 17  Avenue                             40 non-null     object
 18  What are your savings objectives?  40 non-null     object
 19  Reason_Equity                      40 non-null     object
 20  Reason_Mutual                      40 non-null     object
 21  Reason_Bonds                       40 non-null     object
 22  Reason_FD                          40 non-null     object
 23  Source                             40 non-null     object
dtypes: float64(4), int64(4), object(16)
memory usage: 7.6+ KB

In [22]:
for item in df.columns:
    if df[item].isnull().any():
        if df[item].dtype == 'object':
            df[item].fillna(df[item].mode()[0], inplace=True)
        else: df[item].fillna(df[item].mean(), inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 24 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   gender                             40 non-null     object
 1   age                                40 non-null     float64
 2   Investment_Avenues                 40 non-null     object
 3   Mutual_Funds                       40 non-null     float64
 4   Equity_Market                      40 non-null     float64
 5   Debentures                         40 non-null     float64
 6   Government_Bonds                   40 non-null     int64
 7   Fixed_Deposits                     40 non-null     int64
 8   PPF                                40 non-null     int64
 9   Gold                               40 non-null     int64
 10  Stock_Marktet                      40 non-null     object
 11  Factor                             40 non-null     object
 12  Objective                          40 non-null     object
 13  Purpose                            40 non-null     object
 14  Duration                           40 non-null     object
 15  Invest_Monitor                     40 non-null     object
 16  Expect                             40 non-null     object
 17  Avenue                             40 non-null     object
 18  What are your savings objectives?  40 non-null     object
 19  Reason_Equity                      40 non-null     object
 20  Reason_Mutual                      40 non-null     object
 21  Reason_Bonds                       40 non-null     object
 22  Reason_FD                          40 non-null     object
 23  Source                             40 non-null     object
dtypes: float64(4), int64(4), object(16)
memory usage: 7.6+ KB

/var/folders/2s/kw_rwvhn10q4r6bv09y0my5r0000gn/T/ipykernel_2515/2584248640.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  else: df[item].fillna(df[item].mean(), inplace=True)
/var/folders/2s/kw_rwvhn10q4r6bv09y0my5r0000gn/T/ipykernel_2515/2584248640.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[item].fillna(df[item].mode()[0], inplace=True)

In [23]:
#for loop uchun 10ta misol

In [24]:
meals = ['breakfast', 'lunch', 'dinner', 'dessert', 'brunch']
for i in range(5):
    print(meals[i])

breakfast
lunch
dinner
dessert
brunch

In [25]:
for i in range(1,100, 5):
    print(i, end=',')

1,6,11,16,21,26,31,36,41,46,51,56,61,66,71,76,81,86,91,96,

In [30]:
total=0
for i in range(1,111):
    total+=1
print("sum is", total)

sum is 110

In [35]:
word = 'hellowrong'
for charry in word:
    print(charry, end='+')

h+e+l+l+o+w+r+o+n+g+

In [38]:
numbers = [1,2,3,4,5]
for i in numbers:
    print(i*20, end=',')

20,40,60,80,100,

In [39]:
planets = ['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune']
for planet in planets:
    print(planet, end=' ')

Mercury Venus Earth Mars Jupiter Saturn Uranus Neptune

In [40]:
for i in range(1, 11):
    if i % 2 == 0:
        print(i, "is even")

2 is even
4 is even
6 is even
8 is even
10 is even

In [41]:
for i in range(1, 11):
    if i % 2 == 1:
        print(i, "is odd")

1 is odd
3 is odd
5 is odd
7 is odd
9 is odd

In [46]:
for i in range(1, 3):
    for j in range(1, 11):
        print(i, "*", j, "=", i*j)

1 * 1 = 1
1 * 2 = 2
1 * 3 = 3
1 * 4 = 4
1 * 5 = 5
1 * 6 = 6
1 * 7 = 7
1 * 8 = 8
1 * 9 = 9
1 * 10 = 10
2 * 1 = 2
2 * 2 = 4
2 * 3 = 6
2 * 4 = 8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18
2 * 10 = 20

In [ ]:
text = 'sbgnhusbgh wegrberBGHgb w gbeGAIUrwgibwer wergb iuwebrgw'
vowels = 'aeiouAEIOU'
count=0

for charry in text:
    if charry in vowels:
        count+=1
print("number of vowels:", count)

number of vowels: 13

In [4]:
#encoding
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
df = pd.read_csv('insurance.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [5]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [6]:
df.nunique()

age           47
sex            2
bmi          548
children       6
smoker         2
region         4
charges     1337
dtype: int64

In [7]:
df['age']=encoder.fit_transform(df['age'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [8]:
df.head()

   age     sex     bmi  children smoker     region      charges
0    1  female  27.900         0    yes  southwest  16884.92400
1    0    male  33.770         1     no  southeast   1725.55230
2   10    male  33.000         3     no  southeast   4449.46200
3   15    male  22.705         0     no  northwest  21984.47061
4   14    male  28.880         0     no  northwest   3866.85520

In [9]:
#one hot encoding
dum_data = pd.get_dummies(df['sex'], prefix='jins', dtype=int)
dum_data

      jins_female  jins_male
0               1          0
1               0          1
2               0          1
3               0          1
4               0          1
...           ...        ...
1333            0          1
1334            1          0
1335            1          0
1336            1          0
1337            1          0

[1338 rows x 2 columns]

In [10]:
df=pd.concat([df.drop(columns='sex'), dum_data], axis=1)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   age          1338 non-null   int64
 1   bmi          1338 non-null   float64
 2   children     1338 non-null   int64
 3   smoker       1338 non-null   object
 4   region       1338 non-null   object
 5   charges      1338 non-null   float64
 6   jins_female  1338 non-null   int64
 7   jins_male    1338 non-null   int64
dtypes: float64(2), int64(4), object(2)
memory usage: 83.8+ KB

In [11]:
df.tail()

,age,bmi,children,smoker,region,charges,jins_female,jins_male
1333,32,30.97,3,no,northwest,10600.5483,0,1
1334,0,31.92,0,no,northeast,2205.9808,1,0
1335,0,36.85,0,no,southeast,1629.8335,1,0
1336,3,25.80,0,no,southwest,2007.9450,1,0
1337,43,29.07,0,yes,northwest,29141.3603,1,0

In [17]:
#2nd try with one hot
dum_data2=pd.get_dummies(df['smoker'], prefix='smokes', dtype=int)
dum_data2

      smokes_no  smokes_yes
0             0           1
1             1           0
2             1           0
3             1           0
4             1           0
...         ...         ...
1333          1           0
1334          1           0
1335          1           0
1336          1           0
1337          0           1

[1338 rows x 2 columns]

In [18]:
df=pd.concat([df.drop(columns='smoker'), dum_data2], axis=1)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         1338 non-null   int64
 1   sex         1338 non-null   object
 2   bmi         1338 non-null   float64
 3   children    1338 non-null   int64
 4   region      1338 non-null   object
 5   charges     1338 non-null   float64
 6   smokes_no   1338 non-null   int64
 7   smokes_yes  1338 non-null   int64
dtypes: float64(2), int64(4), object(2)
memory usage: 83.8+ KB

In [19]:
df.head()

,age,sex,bmi,children,region,charges,smokes_no,smokes_yes
0,19,female,27.900,0,southwest,16884.92400,0,1
1,18,male,33.770,1,southeast,1725.55230,1,0
2,28,male,33.000,3,southeast,4449.46200,1,0
3,33,male,22.705,0,northwest,21984.47061,1,0
4,32,male,28.880,0,northwest,3866.85520,1,0